app/controllers/musics_controller.rb

  def index
    @musics = Music.all
---
SELECT "musics".* FROM "musics"

  def create

    @music = current_user.music.create(music_params)
---
INSERT INTO "musics" ("created_at", "format", "length", "name", "size", "sizeFormat", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def set_music
      @music = Music.where("userID" => current_user.id)
---
SELECT "musics".* FROM "musics"  WHERE "musics"."userID" = 1